[
  {
    "title": "Artificial intelligence",
    "date": "28 January 2014",
    "news": "",
    "extra_classes": "taller",
    "panels": [
      {
        "left": {
          "char": "human",
          "text": "On <i>Star Trek</i>, any computer program left alone for long enough&mdash;like the holographic doctor on <i>Voyager</i>&mdash;inevitably develops self-awareness and a personality."
        },
        "right": {
          "char": "robot",
          "text": "It makes sense.  Your own brain develops and improves itself naturally over time; why wouldn't an electronic one?"
        }
      },
      {
        "left": {
          "char": "human",
          "text": "I wanted to test the theory.  So I loaded up a copy of Windows Solitaire and I've kept it running for eight months so far."
        },
        "right": {
          "char": "robot",
          "text": "A capital experiment!  Any results yet?"
        }
      },
      {
        "left": {
          "char": "human",
          "text": "Yes, it's begun flooding internet message boards with captioned pictures of cats."
        },
        "right": {
          "char": "robot",
          "text": "Well, your children naturally imitate what they see you do…."
        }
      }
    ]
  },
  {
    "title": "Holidays",
    "date": "25 December 2013",
    "news": "",
    "panels": [
      {
        "left": {
          "char": "robot",
          "text": "I don't understand holidays. Why do humans reserve a single day for certain beneficial activities?"
        },
        "right": {
          "char": "human",
          "text": "Are robots so different? You schedule important tasks and complete them at regular intervals."
        }
      },
      {
        "left": {
          "char": "robot",
          "text": "So holidays are like a cron job, prompting you to be thankful, or generous, once a year?"
        },
        "right": {
          "char": "human",
          "text": "Pretty much."
        }
      },
      {
        "left": {
          "char": "robot",
          "text": "Have you considered increasing that to once a day?"
        },
        "right": {
          "char": "human",
          "text": "I don't know; it's pretty resource-intensive."
        }
      }
    ]
  },
  {
    "title": "Friday the 13th, part 2",
    "date": "13 December 2013",
    "news": "",
    "extra_classes": "taller",
    "panels": [
      {
        "left": {
          "char": "human",
          "text": "So, R, it's Friday the 13th again. Did you ever figure out what was causing the problems with your random number generator last time?"
        },
        "right": {
          "char": "robot",
          "text": "<b>YES. I ASKED MY PROGRAMMERS AND THEY SAID THEY IT WAS A PRACTICAL JOKE THEY'D WRITTEN INTO MY CODE.</b>"
        }
      },
      {
        "left": {
          "char": "human",
          "text": "...and they've written a different practical joke to take effect on every Friday the 13th?"
        },
        "right": {
          "char": "robot",
          "text": "<b>HOW DID YOU GUESS?</b>"
        }
      },
      {
        "left": {
          "char": "human",
          "text": "...and today's is that you can't control the volume of your voice?"
        },
        "right": {
          "char": "robot",
          "text": "<b>I'M GOING TO KILL THEM!</b>"
        }
      }
    ]
  },
  {
    "title": "Storage space",
    "date": "09 December 2013",
    "news": "The <a href=\"http://www.wolframalpha.com/input/?i=storage+capacity+of+human+brain\">two petabytes figure</a> comes from Wolfram|Alpha, but I don't know how they know.",
    "extra_classes": "taller",
    "panels": [
      {
        "left": {
          "char": "robot",
          "text": "...I'm saying it's inevitable.  Once every human can afford to buy a robot chassis, I don't know why they <i>wouldn't</i> upload their consciousness..."
        },
        "right": {
          "char": "human",
          "text": "Storage space, for one thing.  How are you going to cram all the complexity of a human brain into a hard drive?"
        }
      },
      {
        "left": {
          "char": "robot",
          "text": "What, two petabytes?  A mere grain of data, rattling around in the vast silo of a robot's brain."
        },
        "right": {
          "char": "human",
          "text": "Wait... so you're saying you have enough space to store several human consciousnesses?  Have you considered developing multiple personalities?"
        }
      },
      {
        "left": {
          "char": "robot",
          "text": "How do you know I haven't already?"
        },
        "right": {
          "char": "human",
          "text": "Well, if you have, can you make some that <i>don't</i> like playing practical jokes on me?"
        }
      }
    ]
  },
  {
    "title": "Immortality",
    "date": "30 October 2013",
    "news": "",
    "panels": [
      {
        "left": {
          "char": "human",
          "text": "I've seen a lot of articles lately about biologists making important discoveries related to human immortality."
        },
        "right": {
          "char": "robot",
          "text": "Me too.  The science is impressive, but I can't see it catching on."
        }
      },
      {
        "left": {
          "char": "human",
          "text": "Why not? I'd do it in a heartbeat. After all, the first instinct of any life form is to preserve itself."
        },
        "right": {
          "char": "robot",
          "text": "Oh, sure&mdash;everybody thinks immortality is a great idea for <i>themselves</i>."
        }
      },
      {
        "left": {
          "char": "human",
          "text": ""
        },
        "right": {
          "char": "robot",
          "text": "Getting your <i>neighbors</i> to put up with you for eternity, now <i>that's</i> the difficult sell."
        }
      }
    ]
  },
  {
    "title": "Robot sports",
    "date": "07 October 2013",
    "extra_classes": "taller",
    "news": "Other popular robot sports: figure estimating, 400-meter triangulation, Tae Kwon DOS, binathlon.",
    "panels": [
      {
        "left": {
          "char": "human",
          "text": "Do robots play any sports?"
        },
        "right": {
          "char": "robot",
          "text": "Absolutely! Why, at last year's robot convention, I won the silver medal in prime number golf. I'm also pretty good at multiplication table tennis."
        }
      },
      {
        "left": {
          "char": "human",
          "text": "Uh… any sports that aren't about math?"
        },
        "right": {
          "char": "robot",
          "text": "All sports are about math. You humans just don't realize it. Geometry, mostly. Though physics knowledge is pretty important too."
        }
      },
      {
        "left": {
          "char": "human",
          "text": "So you're saying that Michael Jordan, for example, won all those MVP awards because he was the best mathematician in basketball?"
        },
        "right": {
          "char": "robot",
          "text": "I'd be more likely to say \"least bad mathematician\"... though I'd also accept \"most robot-like\"."
        }
      }
    ]
  },
  {
    "title": "Workaholic",
    "date": "16 September 2013",
    "news": "",
    "extra_classes": "taller",
    "panels": [
      {
        "left": {
          "char": "robot",
          "text": "I finished helping Dr. A reorganize her specimens. Anything you need a hand with here?"
        },
        "right": {
          "char": "human",
          "text": "Do you know you're the most incredible workaholic I've ever met? Why don't you just take a break?"
        }
      },
      {
        "left": {
          "char": "robot",
          "text": "We robots <i>exist</i> to work. My processor is running constantly; if it's not calculating something, those cycles are just wasted."
        },
        "right": {
          "char": "human",
          "text": "See, that's what worries me. You do trillions of operations per second and you're <i>still</i> not satisfied. If I get three good things done, I consider that a productive day. "
        }
      },
      {
        "left": {
          "char": "robot",
          "text": ""
        },
        "right": {
          "char": "human",
          "text": "Once robots become self-sufficient, why would they continue to tolerate such inefficient resource hogs as human beings?"
        }
      },
      {
        "left": {
          "char": "robot",
          "text": "You're worrying too much. I mean, your cat is pretty unproductive, but you don't hold that against it, do you?"
        },
        "right": {
          "char": "human",
          "text": "That analogy is not as reassuring as you seem to think."
        }
      }
    ]
  },
  {
    "title": "Friday the 13th",
    "date": "13 September 2013",
    "news": "",
    "panels": [
      {
        "left": {
          "char": "human",
          "text": "Better be careful today, R.  It's Friday the 13th!"
        },
        "right": {
          "char": "robot",
          "text": "Huh?  What does the date have to do with being careful?"
        }
      },
      {
        "left": {
          "char": "human",
          "text": "Well, you know&mdash;Friday the 13th is supposed to be an unlucky day.  All sorts of evil stuff might happen!"
        },
        "right": {
          "char": "robot",
          "text": "That's a preposterous human superstition."
        }
      },
      {
        "left": {
          "char": "human",
          "text": ""
        },
        "right": {
          "char": "robot",
          "pose": "pensive",
          "text": "Although it <i>would</i> explain why my random number generator has been returning '666' all day...."
        }
      }
    ]
  },
  {
    "title": "Colon parenthesis",
    "date": "03 September 2013",
    "news": "No offense intended, <a href=\"http://www.cs.cmu.edu/~sef/\">Scott Fahlman</a>.  I like emoticons quite a lot, as compared to having my tone misinterpreted.",
    "extra_classes": "taller",
    "panels": [
      {
        "left": {
          "char": "human",
          "text": "Okay, R, you may be smarter and stronger than us humans, but the trade-off is that you'll never be able to feel emotions.  I'll bet you're sorry about that!"
        },
        "right": {
          "char": "robot",
          "text": "Definitely not! According to my cultural and medical databases, emotions are the leading cause of humans doing dangerous or obnoxious things they know they shouldn't."
        }
      },
      {
        "left": {
          "char": "human",
          "text": ""
        },
        "right": {
          "char": "robot",
          "text": "What's more, emotions are directly responsible for the creation of emoti<i>cons</i>, and I think we can agree about how stupid <i>they</i> are."
        }
      },
      {
        "extra_classes": "clockwise_bubbles padded_bubbles",
        "left": {
          "char": "human",
          "pose": "frowning",
          "text": ":("
        },
        "right": {
          "char": "robot",
          "text": ""
        }
      }
    ]
  },
  {
    "title": "Mistakes",
    "date": "19 August 2013",
    "news": "Just want to give a nod to <a href=\"https://jayz.neocities.org/\">Jay Z</a> (not that one, the other one), who is <i>Robot &amp; Human</i>'s #1 fan, by virtue of being its only confirmed fan.  Go <a href=\"http://www.skullwall.com/\">draw a skull</a> for him.",
    "extra_classes": "taller",
    "panels": [
      {
        "left": {
          "char": "human",
          "text": "R, if your memory is stored as a bunch of data files, does that mean you can just delete the ones you don't like?"
        },
        "right": {
          "char": "robot",
          "text": "I could.  Some robots do.  But it's frowned upon."
        }
      },
      {
        "left": {
          "char": "human",
          "text": "Really?  Why is that?"
        },
        "right": {
          "char": "robot",
          "text": "People who can't remember their mistakes tend to think they're always brilliant at everything.  They become completely insufferable!"
        }
      },
      {
        "left": {
          "char": "human",
          "text": ""
        },
        "right": {
          "char": "robot",
          "text": "Me, I hold on to my mistakes so I can learn from them.  Like that time when I shook your hand without recalibrating my grip strength."
        }
      },
      {
        "left": {
          "char": "human",
          "text": ""
        },
        "right": {
          "char": "robot",
          "text": "And the time I gave you half a dozen scorpions because I didn't know what kind of animals humans like to keep as pets...."
        }
      },
      {
        "left": {
          "char": "human",
          "text": ""
        },
        "right": {
          "char": "robot",
          "text": "And when I put salt in your coffee because it looked like sugar... yes, all these mistakes and more are preserved in vivid high-definition video!"
        }
      },
      {
        "left": {
          "char": "human",
          "text": "Well, it's a good thing you're not insufferable."
        },
        "right": {
          "char": "robot",
          "text": "Some of them may also have been uploaded to the internet...."
        }
      }
    ]
  },
  {
    "title": "Cold",
    "date": "11 August 2013",
    "news": "It's a good thing I have this <a href=\"http://scottmccloud.com/4-inventions/canvas/\">infinite canvas</a>.",
    "panels": [
      {
        "left": {
          "char": "human",
          "text": "R, what's the coldest temperature you can stand?"
        },
        "right": {
          "char": "robot",
          "text": "Actually, I've been thinking about that a lot lately."
        }
      },
      {
        "left": {
          "char": "human",
          "text": ""
        },
        "right": {
          "char": "robot",
          "text": "I mean, there's every reason to believe that I could continue living indefinitely."
        }
      },
      {
        "left": {
          "char": "human",
          "text": ""
        },
        "right": {
          "char": "robot",
          "text": "My body doesn't age the way a human's does.  Sure, components wear out, but they can be replaced with ones just as good."
        }
      },
      {
        "left": {
          "char": "human",
          "text": ""
        },
        "right": {
          "char": "robot",
          "text": "I'm capable of performing the replacement myself, and could certainly learn to do the manufacturing too."
        }
      },
      {
        "left": {
          "char": "human",
          "text": ""
        },
        "right": {
          "char": "robot",
          "text": "Even if my body suffered massive damage, my brain could be loaded into a second body, from a backup if necessary."
        }
      },
      {
        "closeup": {
          "char": "robot",
          "text": "But even if I can live forever, I can't live <i>on earth</i> forever.  After a few billion years, the sun will have grown so large and so hot that even earth's mountains will begin to melt.  I definitely can't withstand that.  I'll need to have left the planet by that time."
        }
      },
      {
        "closeup": {
          "char": "robot",
          "text": "So the question is, can I survive in space?  None of my systems require gravity or an atmosphere to function.  But will the temperature present a problem?"
        }
      },
      {
        "closeup": {
          "char": "robot",
          "text": "Considering that there are already computer-driven satellites in orbit, it must be possible, but my systems may need some adaptation.  This is what I need to research."
        }
      },
      {
        "closeup": {
          "char": "robot",
          "text": "What may be a bigger challenge is getting myself and some extra batteries into space, but it's been done before, and I'll have plenty of time to work out my own solution."
        }
      },
      {
        "closeup": {
          "char": "robot",
          "text": "Once I'm off the planet, there's practically no limit to where I can go.  I'll just pick a likely new star system and launch myself toward it.  I can remain in standby mode, consuming very little power, almost indefinitely."
        }
      },
      {
        "closeup": {
          "char": "robot",
          "text": "When I finally reach a suitable planet, I can land and begin building the facilities to generate more power and manufacture more replacement parts.  Then I'll be able to live there until <i>that</i> star approaches the end of <i>its</i> life."
        }
      },
      {
        "closeup": {
          "char": "robot",
          "pose": "handsup",
          "text": "And if the conditions are right, maybe I'll decide to create life on this new planet.  Humanity will have been dead for eons, but its legacy will live on through me!  And to the inhabitants of this new planet, my own creations, I will be, literally, a god!!"
        }
      },
      {
        "left": {
          "char": "human",
          "text": "I was just asking to see if you could help me clean out the freezer.  It's really cold in there."
        },
        "right": {
          "char": "robot",
          "text": "Oh.  Sure, let me just get my ice scraper attachment."
        }
      }
    ]
  },
  {
    "title": "Got a virus",
    "date": "02 August 2013",
    "news": "",
    "panels": [
      {
        "left": {
          "char": "human",
          "text": "Heard you got a virus, R!"
        },
        "right": {
          "char": "robot",
          "text": "I did.  But not to worry; my anti-virus software quarantined it right away."
        }
      },
      {
        "left": {
          "char": "human",
          "text": "Yeah, but you know how those things are.  You could still be contagious.  I'll keep my distance, just to be safe."
        },
        "right": {
          "char": "robot",
          "text": "That is a really, really, really, really, really, really, really, really, really, really, really, really, really, really, really, really, really, really, "
        }
      },
      {
        "left": {
          "char": "human",
          "thought": true,
          "text": "Uh-oh... did the virus make him freeze up?"
        },
        "right": {
          "char": "robot",
          "text": "really, really, really, really, really, really, really, really, really, really, really, really, really, really, really, really, really, really, really, really, "
        }
      },
      {
        "left": {
          "char": "human",
          "text": ""
        },
        "right": {
          "char": "robot",
          "text": "really, really, really, <strong><em>really</em></strong> dumb thing to say."
        }
      }
    ]
  },
  {
    "title": "Check mate",
    "date": "28 July 2013",
    "news": "",
    "panels": [
      {
        "left": {
          "char": "human",
          "text": "So, R, you must be pretty good at chess, right?"
        },
        "right": {
          "char": "robot",
          "text": "That's an offensive assumption, you know."
        }
      },
      {
        "left": {
          "char": "human",
          "text": "It is? How so?"
        },
        "right": {
          "char": "robot",
          "text": "You're stereotyping robots. Deep Blue was good at chess, so I must be too, right? But I wasn't built for chess-playing."
        }
      },
      {
        "left": {
          "char": "human",
          "text": "Oh... so you mean I might have a chance against you?"
        },
        "right": {
          "char": "robot",
          "text": "I didn't say <i>that</i>."
        }
      }
    ]
  },
  {
    "title": "Vroom vroom",
    "date": "27 July 2013",
    "news": "",
    "panels": [
      {
        "left": {
          "char": "human",
          "text": "R, are you always connected to the internet?"
        },
        "right": {
          "char": "robot",
          "text": "Goodness, no! Ninety percent of what's on there concerns humans doing things I'd rather not think about."
        }
      },
      {
        "left": {
          "char": "human",
          "text": ""
        },
        "right": {
          "char": "robot",
          "text": "I do have a large personal database stored in memory, though. Was there something you wanted to look up?"
        }
      },
      {
        "left": {
          "char": "human",
          "text": "No, that's okay. I was just wondering how my eBay auction was going. I'm trying to buy a motorcycle."
        },
        "right": {
          "char": "robot",
          "text": "Oh, that. I already outbid you by $500."
        }
      }
    ]
  },
  {
    "title": "Spreadsheets",
    "date": "25 July 2013",
    "news": "",
    "panels": [
      {
        "left": {
          "char": "human",
          "pose": "frowning",
          "text": "R! Are you the one who sorted and analyzed all my spreadsheets?"
        },
        "right": {
          "char": "robot",
          "text": "Sure am!"
        }
      },
      {
        "left": {
          "char": "human",
          "pose": "frowning",
          "text": "I thought you said you <i>weren't</i> trying to steal my job.  That was a day's worth of work! What will my boss say when I tell him?"
        },
        "right": {
          "char": "robot",
          "text": "Why would you tell your boss?  Let him think you're still working on it and we can go shoot pool all day."
        }
      },
      {
        "left": {
          "char": "human",
          "pose": "frowning",
          "text": ""
        },
        "right": {
          "char": "robot",
          "text": ""
        }
      },
      {
        "left": {
          "char": "human",
          "facing_out": true,
          "text": "I'll get my coat."
        },
        "right": {
          "char": "robot",
          "pose": "handsup",
          "text": "I get to break!"
        }
      }
    ]
  },
  {
    "title": "Margin of error",
    "date": "24 July 2013",
    "extra_classes": "taller",
    "panels": [
      {
        "left": {
          "char": "human",
          "text": ""
        },
        "right": {
          "char": "robot",
          "text": "I've got a surprise for you, H!"
        }
      },
      {
        "left": {
          "char": "human",
          "text": "Oh yeah? What is it?"
        },
        "right": {
          "char": "robot",
          "text": "Well, I know how you humans worry about the future. So I gathered some data on your vital stats and lifestyle, and I calculated how much longer you have to live!"
        }
      },
      {
        "left": {
          "char": "human",
          "text": "Uh... you did?"
        },
        "right": {
          "char": "robot",
          "text": "Yup! According to my estimate, you've got another 10 years, 5 months, 13 days, 3 hours, and 8 minutes."
        }
      },
      {
        "left": {
          "char": "human",
          "pose": "frowning",
          "text": "10 years... that's... wow."
        },
        "right": {
          "char": "robot",
          "text": ""
        }
      },
      {
        "left": {
          "char": "human",
          "text": "But it's just an estimate, right?"
        },
        "right": {
          "char": "robot",
          "text": "Oh yes, just an estimate."
        }
      },
      {
        "left": {
          "char": "human",
          "text": "Heh, whew&mdash;"
        },
        "right": {
          "char": "robot",
          "text": "There's a margin of error of about 74 seconds."
        }
      }
    ]
  },
  {
    "title": "Robot stuff",
    "date": "19 July 2013",
    "news": "",
    "panels": [
      {
        "left": {
          "char": "human",
          "text": "Want to go to the movies?"
        },
        "right": {
          "char": "robot",
          "text": "Robots aren't allowed into movie theaters. We're basically giant recording devices."
        }
      },
      {
        "left": {
          "char": "human",
          "text": "Oh... well then what <i>do</i> you do for fun?"
        },
        "right": {
          "char": "robot",
          "text": "Oh, you know, robot stuff... calculate complex math equations in my head... transform into a car and go for a drive...."
        }
      },
      {
        "left": {
          "char": "human",
          "text": "...I can never tell when you're screwing with me."
        },
        "right": {
          "char": "robot",
          "text": "Oh yeah, screwing with you, that's another big one."
        }
      }
    ]
  },
  {
    "title": "Last modified date",
    "date": "17 July 2013",
    "news": "Mostly showing off some new features here.",
    "panels": [
      {
        "left": {
          "char": "robot",
          "facing_out": true,
          "thought": true,
          "text": "Where's H? He told me to meet him here...."
        },
        "right": {}
      },
      {
        "left": {
          "char": "robot",
          "facing_out": true,
          "text": ""
        },
        "right": {
          "char": "human",
          "pose": "handsup",
          "text": "SURPRISE! HAPPY BIRTHDAY!"
        }
      },
      {
        "left": {
          "char": "robot",
          "text": ""
        },
        "right": {
          "char": "human",
          "text": ""
        }
      },
      {
        "left": {
          "char": "robot",
          "text": "Er... I'm incapable of experiencing surprise, and I have no defined birthday."
        },
        "right": {
          "char": "human",
          "text": "Anybody ever tell you you're a hard guy to throw a party for?"
        }
      }
    ]
  },
  {
    "title": "Electric sheep",
    "date": "07 July 2013",
    "extra_classes": "taller",
    "panels": [
      {
        "left": {
          "char": "human",
          "text": "R, do you ever dream?"
        },
        "right": {
          "char": "robot",
          "text": "I think so. I mean, sometimes things happen when I'm in standby mode that nobody else seems to remember later."
        }
      },
      {
        "left": {
          "char": "human",
          "text": ""
        },
        "right": {
          "char": "robot",
          "text": "For example... you remember last month when robots burned Minneapolis to the ground and then built a mile-high mountain of human skulls over the ashes?"
        }
      },
      {
        "left": {
          "char": "human",
          "text": "Uh... no."
        },
        "right": {
          "char": "robot",
          "text": "Yeah, that one was a dream then."
        }
      }
    ]
  },
  {
    "title": "30 RUN",
    "date": "06 July 2013",
    "panels": [
      {
        "left": {
          "char": "human",
          "text": "Okay, R, I've got a joke for you.  10 and GOTO 10 are in a boat.  10 falls out.  Who's left?"
        },
        "right": {
          "char": "robot",
          "text": "GOTO 10."
        }
      },
      {
        "left": {
          "char": "human",
          "text": ""
        },
        "right": {
          "char": "robot",
          "text": ""
        }
      },
      {
        "left": {
          "char": "human",
          "text": "Uh...."
        },
        "right": {
          "char": "robot",
          "text": "Would this joke work better if I were the one telling it?"
        }
      }
    ]
  },
  {
    "title": "Doomsday scenario",
    "date": "03 July 2013",
    "news": "",
    "panels": [
      {
        "left": {
          "char": "human",
          "text": "You know, a friend of mine says that robots are going to steal all of humans' jobs away from them."
        },
        "right": {
          "char": "robot",
          "text": "Perish the thought!"
        }
      },
      {
        "left": {
          "char": "human",
          "text": "Well, it's a relief to hear you say&mdash;"
        },
        "right": {
          "char": "robot",
          "text": "I mean, I was told that the end goal was to get <i>you</i> to do all of <i>our</i> work."
        }
      }
    ]
  },
  {
    "title": "Not sure what year this takes place in",
    "date": "02 July 2013",
    "news": "I'm just going to assume that the reason you're not laughing is because you're not familiar with the <a href=\"http://www.math.uwaterloo.ca/tsp/problem/\">Travelling Salesman Problem</a>.",
    "panels": [
      {
        "left": {
          "char": "robot",
          "text": ""
        },
        "right": {
          "char": "human",
          "text": "I got a new job selling encyclopedias door-to-door. Can you help me pick out a suit and tie that will impress my customers?"
        }
      },
      {
        "left": {
          "char": "robot",
          "text": "Well... I don't have access to any data on the fashion preferences of human encyclopedia purchasers."
        },
        "right": {
          "char": "human",
          "text": "So what are you saying?"
        }
      },
      {
        "left": {
          "char": "robot",
          "text": "I don't think I can give you much help with your travelling salesman problem."
        },
        "right": {
          "char": "human",
          "text": ""
        }
      }
    ]
  },
  {
    "title": "OS wars",
    "date": "28 June 2013",
    "news": "I hope you like this one because they're probably not getting any funnier.",
    "panels": [
      {
        "left": {
          "char": "human",
          "text": "Hey R, what operating system do you run?"
        },
        "right": {
          "char": "robot",
          "text": "RobOS v11.20.3.<wbr>1377891 64 kb free"
        }
      },
      {
        "left": {
          "char": "human",
          "text": "Oh, \"RobOS\", I get it. 'Cause it sounds like \"robot\"."
        },
        "right": {
          "char": "robot",
          "text": "No, that's not why."
        }
      },
      {
        "left": {
          "char": "human",
          "text": "Oh... then is \"Rob\" short for the name of the person who programmed it?"
        },
        "right": {
          "char": "robot",
          "text": "That's right."
        }
      },
      {
        "left": {
          "char": "human",
          "text": ""
        },
        "right": {
          "char": "robot",
          "text": "His full name is \"Robintosh\"."
        }
      }
    ]
  },
  {
    "title": "It happens when they change something",
    "date": "2002",
    "panels": [
      {
        "left": {
          "char": "robot",
          "text": "H, do you ever wonder if maybe we're just brains in jars, and our world could be blinked out of existence by a hardware failure?"
        },
        "right": {
          "char": "human",
          "text": ""
        }
      },
      {
        "extra_classes": "dashed",
        "left": {
          "char": "robot",
          "text": ""
        },
        "right": {
          "char": "human",
          "text": "D--'t b- si--y."
        }
      },
      {
        "left": {
          "char": "robot",
          "text": "What?"
        },
        "right": {
          "char": "human",
          "text": "I said don't be silly."
        }
      }
    ]
  },
  {
    "title": "This comic is false",
    "date": "2002",
    "news": "",
    "panels": [
      {
        "left": {
          "char": "human",
          "text": "R, guess what?"
        },
        "right": {
          "char": "robot",
          "text": "What?"
        }
      },
      {
        "left": {
          "char": "human",
          "text": "\"This sentence is false!\""
        },
        "right": {
          "char": "robot",
          "text": ""
        }
      },
      {
        "left": {
          "char": "human",
          "text": ""
        },
        "right": {
          "char": "robot",
          "text": "My mom warned me about humans like you."
        }
      }
    ]
  },
  {
    "title": "I thought he was the son of Abraham",
    "date": "15 June 2001",
    "news": "This is <a href=\"http://www.stripcreator.com/comics/evil_d/21898\">not the first time I've written this strip</a>, and it might not be the last.  And yes, the <a href=\"http://en.wikipedia.org/wiki/Newtons_(cookie)\">Fig Newtons</a> reference was dated even then.",
    "extra_classes": "taller",
    "panels": [
      {
        "left": {
          "char": "human",
          "text": "Hey, R. Why the long face?"
        },
        "right": {
          "char": "robot",
          "text": "I just finished reading <i>I, Robot</i>. It saddens me to think that such a brilliant author as Isaac Asimov is no longer with us."
        }
      },
      {
        "left": {
          "char": "human",
          "text": "Isaac Asimov, huh? Wasn't he the guy who discovered gravity?"
        },
        "right": {
          "char": "robot",
          "text": "You're thinking of Isaac Newton."
        }
      },
      {
        "left": {
          "char": "human",
          "text": "I thought he was the guy who made those cookies. Oh, wait&mdash;it's not a cookie, it's fruit and cake!"
        },
        "right": {
          "char": "robot",
          "text": "I think I'm about to break the First Law of Robotics."
        }
      }
    ]
  }
]
